% 主成分分析
% 矩阵OA的每一行是1个样本，有3个特征
OA = [
      1 2 1;
	  4 2 13;
	  7 8 1;
	  8 4 5
     ]
% A 是 平均偏差形式
A = OA - mean(OA)
%A = [ -4  -2  -4;
%	  -1  -2   8;
%	   2   4  -4;
%	   3   0   0;
%    ]
% 则数据A的协方差矩阵为
S = 1/(length(A) - 1) * A' * A;
% 方阵S对角线元素之和，叫方阵的迹，是数据的总方差
B = 1/sqrt(length(A) - 1) * A;
[m n] = size(B);
% 进行奇异值分解
[s v d] = svd(B)
% s的维度是m*m, v是m*n, d是n*n
% 其中v是包含奇异值的矩阵，这些奇异值的平方是矩阵B'*B的特征值
% v 的对角线元素的平方和是数据的总方差，是方阵S的迹
trace = sum(diag(v).^2);
% d是矩阵B'*B的正交对角化的单位正交基矩阵的转置，B'*B=PDP'中的P'

% 主成分向量y = [y1;y2;y3;...]
y = d*A';
% y1占数据总方差比
y1Rate = (diag(v)(1))^2/trace

% y1和y2占数据总方差比
y1_2Rate = (diag(v)(1))^2/trace + (diag(v)(2))^2/trace

